import datetime
import json

# ==============================初版=====================================
# INSTRUCTION = f'你是一个精通材料项目名称的专家，请帮我提取下面文本中的地点名和项目名。你可以从下面示例中学习：\n'
#
# examples = [
#     ['学生宿舍、行政楼、2号食堂的6OOx6O0的地砖规格改为800x800。原联系单中地砖规格已改为800x800的工程量不重复计算。所有楼梯间内突出墙面的工字钢需封堵。', {'地点': ['学生宿舍', '行政楼', '2号食堂'], '实施项目': ['地砖', '工字钢']}],
#     ['礼堂二层房间原墙面做法由白色乳胶漆调整为白色无机涂料;', {'地点': ['礼堂'], '实施项目': ['乳胶漆', '无机涂料']}],
#     ['2025年2号食堂开张。', {'地点': ['2号食堂'], '实施项目': []}],
#     ['一号教学楼、科技楼屋面的防水做法从原 1.2 厚三元乙丙橡胶防水卷材+1.5厚聚氨酯防水涂膜(按规定设置防水附加层)，调整为3.0+3.0厚双层SBS改性沥青防水卷材(按规定设置防水附加层)。', {'地点': ['一号教学楼', '科技楼'], '实施项目': ['防水卷材', '防水涂膜']}],
#     ['学生宿舍1号至6号楼架空层柱子、墙体内侧(面向架空层一侧)采用普通外墙涂料(颜色同外墙)。架空层柱子、墙体外侧(朝向室外侧)采用相邻外墙质感涂料。其中架空层墙体需要做防水与保温，做法同外墙;架空层单柱无需做保温及防水。', {'地点': ['学生宿舍'], '实施项目': ['外墙涂料']}],
#     ['安装完成后,第一次打开时输入账号信息即可。', {'地点': '', '实施项目': []}],
#     ['学生宿舍一层清洁间增加排水沟，补充报警阀处排水设施，并变更报警阀位置。', {'地点': ['学生宿舍'], '实施项目': ['排水沟', '报警阀']}],
# ]
#
# PROMPT = INSTRUCTION
# for i, e in enumerate(examples):
#     PROMPT += f'输入{i+1}: "{e[0]}"\n输出{i+1}: {json.dumps(e[1], ensure_ascii=False)}\n'


INSTRUCTION = f'你是一个精通材料项目名称的专家，请帮我提取下面文本中的地点名，以及项目改变前后的材料名称。你可以从下面示例中学习：\n'

examples = [
    [
        '礼堂二层、2号食堂音效功放室增加防静电地板，构造厚度200mm,具体做法详建筑构造做法，原甲级防火门FM1123改为甲级防火门FM1223。',
        {'地点': ['礼堂', '2号食堂'],
         '改变前后的材料': [["", "防静电地板"], ["甲级防火门FM1123", "甲级防火门FM1223"]]}],
    ['图书馆结施-14中,4.150标高处需增加预制叠合板。',
     {'地点': ['图书馆'], '改变前后的材料': [["", "预制叠合板"]]}],
    ['根据甲方要求，图书馆、2号食堂室外楼梯面层由广场砖改为花岗石面层。',
     {'地点': ['图书馆', '2号食堂'], '改变前后的材料': [["广场砖", "花岗石面层"]]}],
    ['安装完成后,第一次打开时输入账号信息即可。',
     {'地点': '', '改变前后的材料': []}],
    ['学生宿舍1号楼1层，沿E轴方向，7轴与8轴、10轴与11轴之间仿木铝合金格栅取消。沿12轴方向，D轴与E轴之间取消使用无机涂料。',
     {'地点': ['学生宿舍'], '改变前后的材料': [['仿木铝合金格栅', ''], ['无机涂料', '']]}
     ],
    ['学生宿舍、行政楼、1号食堂的6OOx6O0的地砖规格改为800x800，Y型柱涂料由白色防霉无机涂料调整为仿清水混凝土涂料，仿木铝合金格栅改为铁制格栅。',
        {'地点': ['学生宿舍', '行政楼', '1号食堂'],
         '改变前后的材料': [['6OOx6O0的地砖', '800x800地砖'], ['白色防霉无机涂料', '仿清水混凝土涂料'], ['仿木铝合金格栅', '铁制格栅']]}],
    ['行政办公楼、图书馆地下车库金刚砂耐磨楼面做法中取消水泥密封固化剂。',
     {'地点': ['行政办公楼', '图书馆'], '改变前后的材料': [['水泥密封固化剂', '']]}
     ]
]

PROMPT = INSTRUCTION
for i, e in enumerate(examples):
    PROMPT += f'输入{i + 1}: "{e[0]}"\n输出{i + 1}: {json.dumps(e[1], ensure_ascii=False)}\n'



INSTRUCTION_DB = f'你是一个精通材料项目名称的专家，请帮我提取下面文本中的材料名称。你可以从下面示例中学习：\n'

examples_db = [
    ['1、混凝土实心砖基础240×115×53^干混砌筑砂浆DMM7.5~砖胎膜', {'材料名': ['实心砖基础', '砌筑砂浆', '砖胎膜']}],
    ['1、现浇商品(泵送)砼楼梯（直形）浇捣^C35', {'材料名': ['砼楼梯']}],
    ['三级螺纹钢箍筋10', {'材料名': ['螺纹钢箍筋']}],
    ['1、50厚C25防水细石砼随捣随抹平,配φ6,双向@150,钢筋网片绑扎或点焊（设分格缝)',
     {'材料名': ['防水细石砼', '钢筋网片']}],
    ['1、防水钢筋混凝土底板厚度≥250,抗渗等级≥P62、刷基层处理剂一遍3、20厚1:2.5水泥砂浆找平层',
     {'材料名': ['防水钢筋混凝土底板', '水泥砂浆找平层']}],
    ['组合窗：LC9，(6mm中透光Low-E+12A+6mm中空钢化玻璃）', {'材料名': ['组合窗', '中空钢化玻璃']}],
    ['普通铝合金百叶窗：BY19815（开孔率≥60%）', {'材料名': ['铝合金百叶窗']}],
]

PROMPT_DB = INSTRUCTION_DB
for i, e in enumerate(examples_db):
    PROMPT_DB += f'输入{i + 1}: "{e[0]}"\n输出{i + 1}: {json.dumps(e[1], ensure_ascii=False)}\n'
